In [3]:
# First, connect to database with ipython-sql extension
# prepare the identitied information
%load_ext sql
import json
import urllib.parse

with open('data/credentials.json') as f:
    login = json.load(f)

username = login['user']
password = urllib.parse.quote(login['password'])
host = login['host']
port = login['port']

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
# connect to our database
%sql postgresql://{username}:{password}@{host}:{port}/dvdrental

'Connected: postgres@dvdrental'

In [6]:
# Now, we can operate our database in this IPython environment
# All the following are Practice questions from the end of lecture 5

In [13]:
%%sql
-- Question: How many rentals has each customer made in total?
SELECT customer_id, COUNT(customer_id) AS amount_of_rentals
FROM rental
GROUP BY customer_id 
ORDER BY COUNT(customer_id) DESC
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(148, 46),
 (526, 45),
 (144, 42),
 (236, 42),
 (75, 41),
 (469, 40),
 (197, 40),
 (468, 39),
 (137, 39),
 (178, 39)]

In [35]:
%%sql
-- Question: What is the average rental duration (i.e., the difference
-- between return_date and rental_date) per customer, ordered from highest to lowest?
SELECT customer_id, AVG(AGE(return_date, rental_date)) AS avg_rental_duration
FROM rental
GROUP BY customer_id
ORDER BY AVG(AGE(return_date, rental_date)) DESC
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(315, datetime.timedelta(days=6, seconds=51202, microseconds=500000)),
 (187, datetime.timedelta(days=6, seconds=39518, microseconds=571428)),
 (321, datetime.timedelta(days=6, seconds=32192, microseconds=727273)),
 (539, datetime.timedelta(days=6, seconds=27597, microseconds=272727)),
 (436, datetime.timedelta(days=6, seconds=25786)),
 (532, datetime.timedelta(days=6, seconds=25174, microseconds=838709)),
 (427, datetime.timedelta(days=6, seconds=19625)),
 (555, datetime.timedelta(days=6, seconds=10115, microseconds=294118)),
 (448, datetime.timedelta(days=6, seconds=8031, microseconds=111111)),
 (453, datetime.timedelta(days=6, seconds=6193, microseconds=43478))]

In [39]:
%%sql
-- How many customers have made more than 5 rentals, 
-- and what is the count of such rentals for the first 10 customers?

SELECT customer_id, COUNT(*) AS rental_amount
FROM rental
GROUP BY customer_id
HAVING COUNT(*) > 5
ORDER BY rental_amount DESC
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(148, 46),
 (526, 45),
 (144, 42),
 (236, 42),
 (75, 41),
 (469, 40),
 (197, 40),
 (468, 39),
 (137, 39),
 (178, 39)]

In [46]:
%%sql
-- Question: Which customers have rented movies for 
-- a total duration (return_date - rental_date) of more than 100 days,
--  and what is the total duration for the first 10 such customers?

SELECT customer_id, SUM(AGE(return_date, rental_date)) AS total_rental_duration
FROM rental
GROUP BY customer_id
HAVING SUM(AGE(return_date, rental_date)) > '100 days'
ORDER BY total_rental_duration DESC
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(526, datetime.timedelta(days=264, seconds=13080)),
 (148, datetime.timedelta(days=243, seconds=8220)),
 (144, datetime.timedelta(days=235, seconds=3480)),
 (137, datetime.timedelta(days=229, seconds=16200)),
 (295, datetime.timedelta(days=221, seconds=26460)),
 (469, datetime.timedelta(days=221, seconds=6360)),
 (468, datetime.timedelta(days=218, seconds=5400)),
 (178, datetime.timedelta(days=214, seconds=24120)),
 (176, datetime.timedelta(days=210, seconds=33900)),
 (236, datetime.timedelta(days=205, seconds=69480))]

In [53]:
%%sql
-- Which customer-staff pairs have the highest number of rentals, 
-- and what is the count of such rentals for the top 10 pairs, 
-- ordered from highest to lowest?

SELECT customer_id, staff_id, COUNT(rental) AS rental_amount
FROM rental
GROUP BY customer_id, staff_id
ORDER BY rental_amount DESC, customer_id DESC
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(236, 1, 27),
 (526, 2, 24),
 (148, 2, 24),
 (144, 1, 24),
 (138, 2, 24),
 (137, 1, 24),
 (38, 2, 24),
 (506, 2, 23),
 (459, 2, 23),
 (297, 2, 23)]